IRP/src/Documents/BankReceipt/BankReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BankReceipt</name>
  <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
  <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
  <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
  <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
  <registerRecords>AccumulationRegister.R3021B_CashInTransitIncoming</registerRecords>
  <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
  <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
  <registerRecords>AccumulationRegister.R3050T_PosCashBalances</registerRecords>
  <registerRecords>AccumulationRegister.R3035T_CashPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
  <registerRecords>AccumulationRegister.R3010B_CashOnHand</registerRecords>
  <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
  <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
  <registerRecords>AccumulationRegister.CashInTransit</registerRecords>
  <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
  <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
  <registerRecords>AccumulationRegister.R3024B_SalesOrdersToBePaid</registerRecords>
  <registerRecords>AccumulationRegister.R2023B_AdvancesFromRetailCustomers</registerRecords>
  <registerRecords>AccumulationRegister.R3026B_SalesOrdersCustomerAdvance</registerRecords>
  <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
  <registerRecords>AccumulationRegister.R3011T_CashFlow</registerRecords>
  <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
  <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
  <registerRecords>InformationRegister.T9050S_AccountingRowAnalytics</registerRecords>
  <registerRecords>InformationRegister.T9051S_AccountingExtDimensions</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyExchange</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.IncomingPaymentTransactionType</types>
    </type>
  </attributes>
  <attributes>
    <name>TransitAccount</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DocNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RRNCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsolidatedRetailSales</name>
    <type>
      <types>DocumentRef.ConsolidatedRetailSales</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisDocument</name>
      <type>
        <types>DefinedType.typeArTransactionBasises</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>NetAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>TotalAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Payer</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>PlaningTransactionBasis</name>
      <type>
        <types>DefinedType.typePlaningTransactionBasises</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountExchange</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>POSAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Commission</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>ProfitLossCenter</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AdditionalAnalytic</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>FinancialMovementType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalNameContract</name>
      <type>
        <types>CatalogRef.LegalNameContracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Order</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentType</name>
      <type>
        <types>CatalogRef.PaymentTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentTerminal</name>
      <type>
        <types>CatalogRef.PaymentTerminals</types>
      </type>
    </attributes>
    <attributes>
      <name>BankTerm</name>
      <type>
        <types>CatalogRef.BankTerms</types>
      </type>
    </attributes>
    <attributes>
      <name>CommissionIsSeparate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>CommissionPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RetailCustomer</name>
      <type>
        <types>CatalogRef.RetailCustomers</types>
      </type>
    </attributes>
    <attributes>
      <name>RevenueType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>SendingAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>SendingBranch</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>VatRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DELETE_TaxList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </attributes>
    <attributes>
      <name>Analytics</name>
      <type>
        <types>CatalogRef.TaxAnalytics</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeToTotalAmount</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/BankReceipt/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;

	CurrenciesClientServer.DeleteUnusedRowsFromCurrenciesTable(ThisObject.Currencies, ThisObject.PaymentList);
	For Each Row In ThisObject.PaymentList Do
		Parameters = CurrenciesClientServer.GetParameters_V8(ThisObject, Row);
		CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies, Row.Key);
		CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);
	EndDo;

	ThisObject.AdditionalProperties.Insert("WriteMode", WriteMode);
	
	ThisObject.DocumentAmount = ThisObject.PaymentList.Total("TotalAmount");
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	WriteMode = CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "WriteMode");
	If FOServer.IsUseAccounting() And WriteMode = DocumentWriteMode.Posting Then
		AccountingServer.OnWrite(ThisObject, Cancel);
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	DocumentsServer.FillCheckBankCashDocuments(ThisObject, CheckedAttributes);
	DocumentsServer.CheckMatchingToBasisDocument(ThisObject, "Account", "Receiver", Cancel);
	
	For Each Row In PaymentList Do
		If Row.TotalAmount = 0 Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_FillTotalAmount, Row.LineNumber));
		EndIf;
	EndDo;
	
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") Then
			If FillingData.BasedOn = "CashTransferOrder"
				Or FillingData.BasedOn = "IncomingPaymentOrder"
				Or FillingData.BasedOn = "SalesInvoice"
				Or FillingData.BasedOn = "SalesOrder"
				Or FillingData.BasedOn = "PurchaseReturn"
				Or FillingData.BasedOn = "SalesReportFromTradeAgent"
				Or FillingData.BasedOn = "EmployeeCashAdvance" Then
					ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingData);
					Filling_BasedOn(FillingData);
			EndIf;
		ElsIf FillingData.Property("Context") Then
			FillingDataStructure = BuilderAPI.GetWrapperFromContext(FillingData.Context).Object;
			ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingDataStructure);
			Filling_BasedOn(FillingDataStructure);
		EndIf;
	EndIf;
EndProcedure

Procedure Filling_BasedOn(FillingData)
	FillPropertyValues(ThisObject, FillingData);
	For Each Row In FillingData.PaymentList Do
		NewRow = ThisObject.PaymentList.Add();
		FillPropertyValues(NewRow, Row);
		If Not ValueIsFilled(NewRow.Key) Then
			NewRow.Key = New UUID();
		EndIf;
	EndDo;
	ThisObject.DocumentAmount = ThisObject.PaymentList.Total("TotalAmount");
EndProcedure

Procedure OnCopy(CopiedObject)
	RRNCode = "";
	PaymentInfo = "";
EndProcedure
